Catalogs/упАлгоритмыОптимизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упАлгоритмыОптимизации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БезопасныйРежимВнешнейОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоддерживаемаяВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадачиОптимизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыЗадачОптимизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищеннаяВерсия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодРешенияЗКДляТиповыхНастроек</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упМетодыРешенияЗК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодРешенияЗМТДляТиповыхНастроек</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упМетодыРешенияЗМТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеАлгоритма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упАлгоритмыОптимизации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Функция - Проверить корректность поставляемого алгоритма оптимизации
//
// Параметры:
//  АлгоритмОптимизации	 - СправочникСсылка.упАлгоритмыОптимизации	 - алгоритм.
// 
// Возвращаемое значение:
//  Булево - признак успешности проверки
//
Функция ПроверитьКорректностьПоставляемогоАлгоритмаОптимизации(АлгоритмОптимизации) Экспорт
	
	Отказ = Ложь;
	Если Не АлгоритмОптимизации.ЗащищеннаяВерсия Тогда
		ТекстОшибки = НСтр("ru = 'Незащищенные версии поставляемых алгоритмов оптимизации не поддерживаются.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		ВнешняяОбработка 	= АлгоритмОптимизации.ВнешняяОбработка;
		ИмяВнешнейОбработки = "";
		Если Истина
			И ЗначениеЗаполнено(ВнешняяОбработка)
			И ЗначениеЗаполнено(ВнешняяОбработка.ТекущаяВерсия) 
			Тогда
			ДвоичныеДанные 			  = РаботаСФайламиСлужебныйВызовСервера.ПолучитьХранилищеФайлаИзИнформационнойБазы(ВнешняяОбработка.ТекущаяВерсия).Получить();
			АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			ИмяВнешнейОбработки       = ВнешниеОбработки.Подключить(АдресВоВременномХранилище,, АлгоритмОптимизации.БезопасныйРежимВнешнейОбработки);
		Иначе
			ТекстОшибки = НСтр(СтрШаблон("ru = 'У подключаемого алгоритма оптимизации %1 не загружена внешняя обработка с произвольным алгоритмом.'", АлгоритмОптимизации)); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли;	
	КонецЕсли; 
	
	Если Не Отказ Тогда
		ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяВнешнейОбработки, АлгоритмОптимизации.БезопасныйРежимВнешнейОбработки);
		СведенияОбОбработке = Неопределено;
		Попытка
			СведенияОбОбработке = ВнешняяОбработка.СведенияОбОбработке();
		Исключение
			ТекстОшибки = НСтр("ru = 'В загруженной внешней обработке алгоритма оптимизации отсутствует обязательная экспортная функция СведенияОбОбработке().'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецПопытки;	
	КонецЕсли; 

	Если Не Отказ Тогда
		Если ТипЗнч(СведенияОбОбработке) = Тип("Структура") Тогда
			Если Не СведенияОбОбработке.Свойство("ИмяМакетаЗащиты") Тогда
				ТекстОшибки = НСтр("ru = 'У загруженной внешней обработки алгоритма оптимизации отсутствует обязательное свойство ""ИмяМакетаЗащиты"", возвращаемое вызовом функции СведенияОбОбработке().'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
			КонецЕсли;
			
			Если Не СведенияОбОбработке.Свойство("ИмяЗагруженнойВМакетОбработки") Тогда
				ТекстОшибки = НСтр("ru = 'У загруженной внешней обработки алгоритма оптимизации отсутствует обязательное свойство ""ИмяЗагруженнойВМакетОбработки"", возвращаемое вызовом функции СведенияОбОбработке().'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
			КонецЕсли;
		Иначе
			ТекстОшибки = НСтр("ru = 'У загруженной внешней обработки алгоритма оптимизации отсутствуют обязательные свойства, возвращаемые вызовом функции СведенияОбОбработке().'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли; 
	КонецЕсли; 

	Возврат Не Отказ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
